app/helpers/user_helper.rb

  def pending_invitation(invitation)
    User.find(invitation.user_id).name
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]