app/models/user.rb

SELECT "invitations"."friend_id" FROM "invitations" WHERE "invitations"."user_id" = $1 AND "invitations"."confirmed" = $2  [["user_id", 2], ["confirmed", true]]
SELECT "invitations"."user_id" FROM "invitations" WHERE "invitations"."friend_id" = $1 AND "invitations"."confirmed" = $2  [["friend_id", 2], ["confirmed", true]]
---
  def friends
    friends_i_sent_invite = Invitation.where(user_id: id, confirmed: true).pluck(:friend_id)
    friends_i_got_invite = Invitation.where(friend_id: id, confirmed: true).pluck(:user_id)